{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "trainable": true, "name": "masking_1", "batch_input_shape": [null, 3, 17], "mask_value": -1}}, {"class_name": "LSTM", "config": {"go_backwards": false, "activation": "tanh", "implementation": 1, "dropout": 0.2, "batch_input_shape": [null, 3, 17], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "trainable": true, "units": 32, "recurrent_constraint": null, "dtype": "float32", "name": "lstm_1", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "unroll": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "stateful": false, "return_sequences": false, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"dtype": "float32", "activation": "linear", "name": "dense_1", "batch_input_shape": [null, 32], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 10}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.2"}